Конфигурация/Documents/РазмещениеКредитногоИнструмента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РазмещениеКредитногоИнструмента</Name>
			<BasedOn>
				<xr:Item>Document.Распоряжение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Распоряжение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Довнесение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РазмещениеКредитногоИнструмента/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ЗначениеРеквизитовОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "ПометкаУдаления, ВидОперации");

		Если ЗначениеРеквизитовОснования.ПометкаУдаления Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать документы на основании помеченного на удаление распоряжения!",,,, Отказ);				
		КонецЕсли;
		
		Если ЗначениеРеквизитовОснования.ВидОперации = Перечисления.ВидыОперацийБэкОфиса.МНО Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создать [Размещение кредитного инструмента] на основании распоряжения на МНО!",,,, Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	Оповестить("РаспоряженияНаРазмещениеДепозитов.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СОБЫТИЯ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не ПроверитьКорректностьРасчетногоСчета() Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КредитныйИнструментПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		Объект.Сумма = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КредитныйИнструмент, "_НачальныйНоминал");
	КонецЕсли;
	
	Если ЭтаФорма.ИсточникДенежныхСредств <> ЗначениеПереключателяСБиржи()
		И РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(Объект.КредитныйИнструмент)
	Тогда
		
		ЭтаФорма.ИсточникДенежныхСредств = ЗначениеПереключателяСБиржи();
		
		ОчиститьДанныеРасчетногоСчета();
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КредитныйИнструментНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.КредитныйИнструмент) И ЗначениеЗаполнено(Объект.Основание) Тогда
		
		Если Вопрос("Создать новый депозитный вклад?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПараметрыФормы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание, "Организация, СчетДоверительногоУправления, Банк, Процент, Сумма, Валюта, ДатаРазмещения, ДатаВозврата, Биржевой");
				
			ПараметрыДепозита = ОткрытьФормуМодально("Обработка.Распоряжения.Форма.ПараметрыКредитныхИнструментов", ПараметрыФормы, ЭтаФорма);
			
			Если ПараметрыДепозита <> Неопределено Тогда
				
				ПараметрыДепозита.Вставить("Документ", Объект.Основание);
				
				Объект.КредитныйИнструмент = СоздатьДепозитныйВкладНаСервере(Объект.Организация, ПараметрыДепозита);
				
				КредитныйИнструментПриИзменении(Элемент);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	ВидДвиженияДС = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход");
	РеквизитыКредитногоИнструмента = Новый Структура("Контрагент, РасчетныйСчетКонтрагента");
	
	Если ТипЗнч(Объект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		РеквизитыКредитногоИнструмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КредитныйИнструмент, Новый Структура("Контрагент, РасчетныйСчетКонтрагента", "БанковскийСчет.ЮрФизЛицо", "БанковскийСчет"));
	ИначеЕсли ТипЗнч(Объект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		
		ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(Объект.КредитныйИнструмент, Объект.Дата);
		Если НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.Контрагент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан контрагент в условиях займа", Объект.КредитныйИнструмент);
			Возврат;
		КонецЕсли;
		
		Если ДанныеКредитногоИнструмента.ЭтоЗаймПолученный Тогда
			ВидДвиженияДС = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход");
		КонецЕсли;
		
		РеквизитыКредитногоИнструмента.Контрагент = ДанныеКредитногоИнструмента.Контрагент;
		РеквизитыКредитногоИнструмента.РасчетныйСчетКонтрагента = Объект.РасчетныйСчет;
	КонецЕсли;
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			ВидДвиженияДС,
			Объект.Сумма,
			РеквизитыКредитногоИнструмента.Контрагент,
			РеквизитыКредитногоИнструмента.РасчетныйСчетКонтрагента),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		
		ОчиститьДанныеРасчетногоСчета();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выбором расчетного счета необходимо указать счет доверительного управления.",, "Объект.СчетДоверительногоУправления");
		
	ИначеЕсли Не ПроверитьКорректностьРасчетногоСчета() Тогда
		
		ОчиститьДанныеРасчетногоСчета();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДенежныхСредствПриИзменении(Элемент)
	
	ОчиститьДанныеРасчетногоСчета();
	
	Если ЭтаФорма.ИсточникДенежныхСредств = ЗначениеПереключателяИзПути() Тогда
		Объект.РасчетныйСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ДенежныеСредстваВПути");
	КонецЕсли;
	
	Если (ЭтаФорма.ИсточникДенежныхСредств = ЗначениеПереключателяСБиржи())
		<> РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(Объект.КредитныйИнструмент)
	Тогда
		Объект.КредитныйИнструмент = Неопределено;	
	КонецЕсли;	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Если Не ПроверитьКорректностьРасчетногоСчета() Тогда
		Объект.РасчетныйСчет = Неопределено;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	ЭтаФорма.ИсточникДенежныхСредств = ОпределитьЗначениеПереключателя(Объект.РасчетныйСчет, Объект.КредитныйИнструмент);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	Элементы = Форма.Элементы;
	ДанныеОбъекта = Форма.Объект;
	
	СредстваИзПути	= (Форма.ИсточникДенежныхСредств = ЗначениеПереключателяИзПути());
	СредстваСоСчета	= (Форма.ИсточникДенежныхСредств = ЗначениеПереключателяСоСчета());
	СредстваСБиржи	= (Форма.ИсточникДенежныхСредств = ЗначениеПереключателяСБиржи());
	
	Элементы.РасчетныйСчет.Видимость			= СредстваСоСчета;
	Элементы.СтрокаБанковскойВыписки.Видимость	= СредстваСоСчета;
	
	ТребуетсяЗаполнениеОснования = РаботаСДокументами.ТребуетсяЗаполнениеОснованияДокументаРазмещениеКредитногоИнструмента(ДанныеОбъекта.Дата, ДанныеОбъекта.Организация, СредстваСБиржи);
	
	Элементы.Основание.Видимость                 = (ТребуетсяЗаполнениеОснования Или ЗначениеЗаполнено(ДанныеОбъекта.Основание));
	Элементы.Основание.АвтоОтметкаНезаполненного = ТребуетсяЗаполнениеОснования;
		
	Элементы.КредитныйИнструмент.Заголовок = ПолучитьЗаголовокКредитногоИнструмента(ТипЗнч(ДанныеОбъекта.КредитныйИнструмент));
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДепозитныйВкладНаСервере(Организация, ИсходныеДанные)
			
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Документ",					Новый ОписаниеТипов("ДокументСсылка.Распоряжение"));
	ТаблицаДанных.Колонки.Добавить("УчетныйАктив",				Новый ОписаниеТипов("СправочникСсылка.УчетныеАктивыЕПС"));
 	ТаблицаДанных.Колонки.Добавить("РасчетныйСчетДепозита",		Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
 	ТаблицаДанных.Колонки.Добавить("НомерПодтверждения",		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(70)));
	ТаблицаДанных.Колонки.Добавить("ДатаПодтверждения",			Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("ДепозитЗаключенПоДоговору",	Новый ОписаниеТипов("Булево"));
	ТаблицаДанных.Колонки.Добавить("Биржевой",					Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = ТаблицаДанных.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходныеДанные);
	
	МассивСсылок = Обработки.Распоряжения.СоздатьДепозитыИРазмещения(Организация, ТаблицаДанных, Ложь);
	
	Если ТипЗнч(МассивСсылок) = Тип("Массив") И МассивСсылок.Количество() > 0 Тогда
		Возврат МассивСсылок[0];
	КонецЕсли;
					
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьЗаголовокКредитногоИнструмента(ТипКредитногоИнструмента)
	
	Если ТипКредитногоИнструмента = Тип("СправочникСсылка.Займы") Тогда
		Возврат "Займ"
	Иначе
		Возврат "Депозитный вклад"
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПроверитьКорректностьРасчетногоСчета()
	
	ОшибкаЗаполнения = Ложь;
	
	Если ЭтаФорма.ИсточникДенежныхСредств = ЗначениеПереключателяСоСчета()
		И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления)
		И ЗначениеЗаполнено(Объект.РасчетныйСчет)
		И Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", 
			ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет"))
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату [" + Объект.Дата + "] отсутствует расчетный счет [" + Объект.РасчетныйСчет + "] в исполнителях (собственных) счета ДУ [" + Объект.СчетДоверительногоУправления + "].",, "Объект.РасчетныйСчет", , ОшибкаЗаполнения);
	КонецЕсли;
	
	Возврат Не ОшибкаЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьДанныеРасчетногоСчета()
	
	Объект.РасчетныйСчет			= Неопределено;
	Объект.СтрокаБанковскойВыписки	= Неопределено;
	
	ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	
КонецПроцедуры

#Область Работа_с_переключателями_источника_денежных_средств

&НаСервереБезКонтекста
Функция ОпределитьЗначениеПереключателя(РасчетныйСчет, КредитныйИнструмент)

	Если РасчетныйСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчета.ДенежныеСредстваВПути") Тогда
		Возврат ЗначениеПереключателяИзПути();
	ИначеЕсли РаботаСКредитнымиИнструментами.ЭтоБиржевойДепозит(КредитныйИнструмент) Тогда
		Возврат ЗначениеПереключателяСБиржи();
	Иначе
		Возврат ЗначениеПереключателяСоСчета();
	КонецЕсли;

КонецФункции	
	
&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяИзПути()
	Возврат 1;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяСоСчета()
	Возврат 2;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеПереключателяСБиржи()
	Возврат 3;
КонецФункции

#КонецОбласти

#КонецОбласти
